# YOLOv8-MobileNetV3 configuration

# YOLOv8-MobileNetV3 configuration

nc: 80 
scales: 
  n: [0.33, 0.25, 1024] 

# MobileNetV3-Small Backbone
# ARGS format: [In_Channels, Out_Channels, Stride, Expand_Ratio]
# Note: For ConvBNActivation it is [In, Out, Kernel, Stride]
backbone:
  # Layer 0: Image (3) -> 16. Fixed the args to be explicit.
  - [-1, 1, ConvBNActivation, [3, 16, 3, 2]]      # 0-P1/2  (3->16)

  # Layer 1: 16 -> 16
  - [-1, 1, InvertedResidual, [16, 16, 2, 1]]     # 1-P2/4  (16->16)

  # Layer 2: 16 -> 24 (Your old YAML asked for 24 input here, which caused a mismatch)
  - [-1, 1, InvertedResidual, [16, 24, 2, 4.5]]   # 2-P3/8  (16->24)

  # Layer 3: 24 -> 24
  - [-1, 1, InvertedResidual, [24, 24, 1, 3.66]]  # 3       (24->24)

  # Layer 4: 24 -> 40
  - [-1, 1, InvertedResidual, [24, 40, 2, 4]]     # 4-P4/16 (24->40)

  # Layer 5-6: 40 -> 40
  - [-1, 1, InvertedResidual, [40, 40, 1, 6]]     # 5
  - [-1, 1, InvertedResidual, [40, 40, 1, 6]]     # 6

  # Layer 7: 40 -> 48
  - [-1, 1, InvertedResidual, [40, 48, 1, 3]]     # 7

  # Layer 8: 48 -> 48
  - [-1, 1, InvertedResidual, [48, 48, 1, 3]]     # 8

  # Layer 9: 48 -> 96
  - [-1, 1, InvertedResidual, [48, 96, 2, 6]]     # 9-P5/32 (48->96)

  # Layer 10-11: 96 -> 96
  - [-1, 1, InvertedResidual, [96, 96, 1, 6]]     # 10
  - [-1, 1, InvertedResidual, [96, 96, 1, 6]]     # 11

# YOLOv8 Head (No changes needed, but ensure 'from' indices match)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 (Layer 6 is 40ch)
  - [-1, 3, C2f, [512]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3 (Layer 3 is 24ch)
  - [-1, 3, C2f, [256]]  # 17

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]] 

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] 
  - [-1, 3, C2f, [1024]] 

  - [[17, 20, 23], 1, Detect, [nc]]